#include <stdio.h>
#include <unistd.h>

int main(void)
{
    int tasks_counter;
    char finish[100];
    char alex_help[100];

    printf("Сколько задач у тебя сейчас (в цифрах): \n");
    scanf("%d", &tasks_counter);

    int ch;
    while ((ch = getchar()) != '\n' && ch != EOF);

    printf("Нужна ли тебе помощь Саши (Да/Нет): \n");
    fgets(alex_help, sizeof(alex_help), stdin);
    printf("Когда планируешь их закончить (сегодня/завтра/и тд.): \n");
    fgets(finish, sizeof(finish), stdin);

    printf("----------------------------------------------------\n");
    printf("Итоги встречи: \n");
    printf("Кол-во задач на текущий момент: %i \n", tasks_counter);
    printf("Когда закончишь: %s", finish);
    printf("Нужен ли Саша: %s \n", alex_help);
    printf("----------------------------------------------------\n");
    printf("\n"
           "███╗░░██╗░█████╗░███████╗██████╗░░█████╗░██╗░░░░░  ████████╗███████╗██████╗░██╗░░░██╗░█████╗░\n"
           "████╗░██║██╔══██╗██╔════╝██╔══██╗██╔══██╗██║░░░░░  ╚══██╔══╝██╔════╝██╔══██╗╚██╗░██╔╝██╔══██╗\n"
           "██╔██╗██║███████║█████╗░░██████╦╝███████║██║░░░░░  ░░░██║░░░█████╗░░██████╦╝░╚████╔╝░███████║\n"
           "██║╚████║██╔══██║██╔══╝░░██╔══██╗██╔══██║██║░░░░░  ░░░██║░░░██╔══╝░░██╔══██╗░░╚██╔╝░░██╔══██║\n"
           "██║░╚███║██║░░██║███████╗██████╦╝██║░░██║███████╗  ░░░██║░░░███████╗██████╦╝░░░██║░░░██║░░██║\n"
           "╚═╝░░╚══╝╚═╝░░╚═╝╚══════╝╚═════╝░╚═╝░░╚═╝╚══════╝  ░░░╚═╝░░░╚══════╝╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝\n");
    printf("----------------------------------------------------\n");
    for (int i = 1; i <= 100; i++) {
        printf("\r\033[K");
        for (int j = 1; j < 10; j++) {
            printf("-Ha");
            fflush(stdout);
            sleep(1);
        }
    }
}